tap "homebrew/cask-fonts"
tap "shivammathur/extensions"
tap "shivammathur/php"
# Automatic configure script builder
brew "autoconf"
# Core application library for C
brew "glib"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Text processing system for reStructuredText
brew "docutils"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Utilities for manipulating PostScript documents
brew "psutils"
# GNU troff text-formatting system
brew "groff"
# Next generation open source RPC library and framework
brew "grpc"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Apache Kafka C/C++ library
brew "librdkafka"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Open source relational database management system
brew "mysql-client", link: true
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc", link: false
# Tool Command Language
brew "tcl-tk"
# User interface to the TELNET protocol
brew "telnet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# gRPC PHP extension
brew "shivammathur/extensions/grpc@8.0"
# gRPC PHP extension
brew "shivammathur/extensions/grpc@8.1"
# gRPC PHP extension
brew "shivammathur/extensions/grpc@8.2"
# Imagick PHP extension
brew "shivammathur/extensions/imagick@7.4"
# Imagick PHP extension
brew "shivammathur/extensions/imagick@8.0"
# Imagick PHP extension
brew "shivammathur/extensions/imagick@8.1"
# Imagick PHP extension
brew "shivammathur/extensions/imagick@8.2"
# Protobuf PHP extension
brew "shivammathur/extensions/protobuf@8.0"
# Protobuf PHP extension
brew "shivammathur/extensions/protobuf@8.1"
# Protobuf PHP extension
brew "shivammathur/extensions/protobuf@8.2"
# Rdkafka PHP extension
brew "shivammathur/extensions/rdkafka@8.0"
# Rdkafka PHP extension
brew "shivammathur/extensions/rdkafka@8.1"
# Rdkafka PHP extension
brew "shivammathur/extensions/rdkafka@8.2"
# General-purpose scripting language
brew "shivammathur/php/php@7.4"
# General-purpose scripting language
brew "shivammathur/php/php@8.0"
# General-purpose scripting language
brew "shivammathur/php/php@8.1", link: true
# General-purpose scripting language
brew "shivammathur/php/php@8.2", link: true
cask "font-inconsolata"
# MySQL/MariaDB database management
cask "sequel-ace"
